tutorials/incompressible/MRFSimpleFoam/mixerVessel2D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="MRFSimpleFoam"

# Build tutorial app
wmake ../$application

./makeMesh
runApplication $application
